{
  "<|mask_0|>": 50260,
  "<|mask_10|>": 50270,
  "<|mask_11|>": 50271,
  "<|mask_12|>": 50272,
  "<|mask_13|>": 50273,
  "<|mask_14|>": 50274,
  "<|mask_15|>": 50275,
  "<|mask_16|>": 50276,
  "<|mask_17|>": 50277,
  "<|mask_18|>": 50278,
  "<|mask_19|>": 50279,
  "<|mask_1|>": 50261,
  "<|mask_20|>": 50280,
  "<|mask_21|>": 50281,
  "<|mask_22|>": 50282,
  "<|mask_23|>": 50283,
  "<|mask_24|>": 50284,
  "<|mask_25|>": 50285,
  "<|mask_26|>": 50286,
  "<|mask_27|>": 50287,
  "<|mask_28|>": 50288,
  "<|mask_29|>": 50289,
  "<|mask_2|>": 50262,
  "<|mask_30|>": 50290,
  "<|mask_31|>": 50291,
  "<|mask_32|>": 50292,
  "<|mask_33|>": 50293,
  "<|mask_34|>": 50294,
  "<|mask_35|>": 50295,
  "<|mask_36|>": 50296,
  "<|mask_37|>": 50297,
  "<|mask_38|>": 50298,
  "<|mask_39|>": 50299,
  "<|mask_3|>": 50263,
  "<|mask_40|>": 50300,
  "<|mask_41|>": 50301,
  "<|mask_42|>": 50302,
  "<|mask_43|>": 50303,
  "<|mask_44|>": 50304,
  "<|mask_45|>": 50305,
  "<|mask_46|>": 50306,
  "<|mask_47|>": 50307,
  "<|mask_48|>": 50308,
  "<|mask_49|>": 50309,
  "<|mask_4|>": 50264,
  "<|mask_50|>": 50310,
  "<|mask_51|>": 50311,
  "<|mask_52|>": 50312,
  "<|mask_53|>": 50313,
  "<|mask_54|>": 50314,
  "<|mask_55|>": 50315,
  "<|mask_56|>": 50316,
  "<|mask_57|>": 50317,
  "<|mask_58|>": 50318,
  "<|mask_59|>": 50319,
  "<|mask_5|>": 50265,
  "<|mask_60|>": 50320,
  "<|mask_61|>": 50321,
  "<|mask_62|>": 50322,
  "<|mask_63|>": 50323,
  "<|mask_64|>": 50324,
  "<|mask_65|>": 50325,
  "<|mask_66|>": 50326,
  "<|mask_67|>": 50327,
  "<|mask_68|>": 50328,
  "<|mask_69|>": 50329,
  "<|mask_6|>": 50266,
  "<|mask_70|>": 50330,
  "<|mask_71|>": 50331,
  "<|mask_72|>": 50332,
  "<|mask_73|>": 50333,
  "<|mask_74|>": 50334,
  "<|mask_75|>": 50335,
  "<|mask_76|>": 50336,
  "<|mask_77|>": 50337,
  "<|mask_78|>": 50338,
  "<|mask_79|>": 50339,
  "<|mask_7|>": 50267,
  "<|mask_80|>": 50340,
  "<|mask_81|>": 50341,
  "<|mask_82|>": 50342,
  "<|mask_83|>": 50343,
  "<|mask_84|>": 50344,
  "<|mask_85|>": 50345,
  "<|mask_86|>": 50346,
  "<|mask_87|>": 50347,
  "<|mask_88|>": 50348,
  "<|mask_89|>": 50349,
  "<|mask_8|>": 50268,
  "<|mask_90|>": 50350,
  "<|mask_91|>": 50351,
  "<|mask_92|>": 50352,
  "<|mask_93|>": 50353,
  "<|mask_94|>": 50354,
  "<|mask_95|>": 50355,
  "<|mask_96|>": 50356,
  "<|mask_97|>": 50357,
  "<|mask_98|>": 50358,
  "<|mask_99|>": 50359,
  "<|mask_9|>": 50269,
  "<|r|>": 50257,
  "<|s|>": 50258,
  "<|x|>": 50259
}
